api/creador_vehiculos_api/app/controllers/usuario_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)
    if @usuario.save
---
INSERT INTO "usuarios" ("nombre", "write", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["nombre", "Pablo Blanco"], ["write", 1], ["created_at", "2024-05-20 10:16:48.041213"], ["updated_at", "2024-05-20 10:16:48.041213"]]