api/creador_vehiculos_api/app/controllers/vehiculo_controller.rb

SELECT "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."usuario" = ?  [["usuario", "Jorge"]]
---
  def index
    @vehiculos = Vehiculo.where(usuario: params[:usuario])

SELECT "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @vehiculo = Vehiculo.find(params[:id])

INSERT INTO "vehiculos" ("motor", "ruedas", "carroceria", "personalizacion", "usuario", "created_at", "updated_at", "color") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @vehiculo = Vehiculo.new(vehiculo_params)
    if @vehiculo.save

SELECT "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "vehiculos" SET "updated_at" = ?, "color" = ? WHERE "vehiculos"."id" = ?  [["updated_at", "2024-05-20 14:13:35.544256"], ["color", "rojo"], ["id", 2]]
---
  def update
    @vehiculo = Vehiculo.find(params[:id])
    if @vehiculo.update(vehiculo_params)

SELECT "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "vehiculos" WHERE "vehiculos"."id" = ?  [["id", 3]]
---
  def destroy
    @vehiculo = Vehiculo.find(params[:id])
    if @vehiculo.destroy